IDENTIFICATION DIVISION.
program-id. Hello.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SPECIAL-NAMES.
DECIMAL-POINT IS COMMA.
DATA DIVISION.
WORKING-STORAGE SECTION.
77 WRK-NOME PIC A(20) VALUE SPACES.
77 WRK-CPF PIC 9(11) VALUE ZEROS.
procedure division.
ACCEPT WRK-NOME FROM CONSOLE.
ACCEPT WRK-CPF FROM CONSOLE.
DISPLAY 'NOME:' WRK-NOME.
DISPLAY 'CPF:' WRK-CPF.
STOP RUN
      