IDENTIFICATION DIVISION.
       PROGRAM-ID. VENDAATIV.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
           SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
	   77 WRK-VENDA1 PIC 9(03)V99 VALUE ZEROS.
	   77 WRK-VENDA2 PIC 9(03)V99 VALUE ZEROS.
	   77 WRK-RESULT PIC S9(04)V99 VALUE ZEROS.
       77 WRK-RESULT-ED PIC $-ZZZ9,99 VALUE ZEROS.
       PROCEDURE DIVISION.
	       ACCEPT WRK-VENDA1 FROM CONSOLE.
           ACCEPT WRK-VENDA2 FROM CONSOLE.
		   ADD WRK-VENDA1 WRK-VENDA2 TO WRK-RESULT.
          
           DISPLAY 'RESUMO DA COMPRA'
           DISPLAY '---------------------------'
           DISPLAY 'VENDA 1= ' WRK-VENDA1.
           DISPLAY 'VENDA 2= ' WRK-VENDA2.
           MOVE WRK-RESULT TO WRK-RESULT-ED
           DISPLAY 'TOTAL DA COMPRA = ' WRK-RESULT-ED
           
          
         
		   
         
           MULTIPLY WRK-VENDA1 BY WRK-VENDA2 GIVING WRK-RESULT-ED.
          
           COMPUTE WRK-RESULT-ED = (WRK-VENDA1+WRK-VENDA2)/2.
           DISPLAY 'MÉDIA DA COMPRA É ' WRK-RESULT-ED.
           
           DISPLAY 'VOLTE SEMPRE'
           STOP RUN.