 IDENTIFICATION DIVISION.
       PROGRAM-ID. aulaif.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
	   77 WRK-VENDAS      PIC 9(06)V99 VALUE ZEROS.
	   77 WRK-QUANTIDADE  PIC 9(03)    VALUE ZEROS.
	   77 WRK-ACUMULO     PIC 9(08)V99 VALUE ZEROS.
	
	   PROCEDURE DIVISION.
	   0001-PRINCIPAL.
	        PERFORM 0100-INICIALIZAR.
	        IF WRK-VENDAS > 0
	        PERFORM 0200-PROCESSAR UNTIL WRK-VENDAS = 0 
	        END-IF.
	        PERFORM 0300-FINALIZAR
	        
	  STOP RUN.      
	   
	   
	   
	   
	   
	   0100-INICIALIZAR.
	      ACCEPT WRK-VENDAS.
         
	   
	   
	   
	   
	   0200-PROCESSAR.
	        ADD 1 TO WRK-QUANTIDADE.
	        ADD WRK-VENDAS TO WRK-ACUMULO.
	        PERFORM 0100-INICIALIZAR.
	   
	    

	        
	      
	   
	   
	   
	   
	   0300-FINALIZAR.
	   
	   DISPLAY '------------------'.
	   DISPLAY ' ACUMULADO ' WRK-ACUMULO.
	   DISPLAY ' QUANTIDADE DE VENDAS ' WRK-QUANTIDADE.
	   DISPLAY 'FINAL DE PROCESSAMENTO'.
