       IDENTIFICATION DIVISION.
       PROGRAM-ID. PRGCOB01.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
	   77 WRK-NUM1 PIC 9(02) VALUE ZEROS.
	   77 WRK-NUM2 PIC 9(02) VALUE ZEROS.
	   77 WRK-RESULT PIC S9(04) VALUE ZEROS.
	        PROCEDURE DIVISION.
	   
           ACCEPT WRK-NUM1 FROM CONSOLE.
           ACCEPT WRK-NUM2 FROM CONSOLE.
		   
           DISPLAY '========================='
           DISPLAY 'NÚMERO 1= ' WRK-NUM1.
           DISPLAY 'NÚMERO 2= ' WRK-NUM2.
        
           SUBTRACT WRK-NUM2 FROM WRK-NUM1 GIVING WRK-RESULT.
           DISPLAY 'RESULTADO SUBTRAÇÃO ='WRK-RESULT.
		   
           
           STOP RUN.
		   
		   
		   
	*	   *A SUBTRAÇÃO FOI FEITA SUBTRAINDO O SEGUNDO ITEM PELO PRIMEIRO.
	*	   E FOI COLOCADO UM S NA FRENTE DO NÚMERO 9, PARA SIGNIFICAR QUE DEVE-SE CONSIDERRAR O SINAL
		   
	*	ABAIXO, CÓDIGO COM MASCARA

       IDENTIFICATION DIVISION.
       PROGRAM-ID. PRGCOB01.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
	   77 WRK-NUM1 PIC 9(02) VALUE ZEROS.
	   77 WRK-NUM2 PIC 9(02) VALUE ZEROS.
	   77 WRK-RESULT PIC S9(03) VALUE ZEROS.
	   77 WRK-RESULT-ED PIC -ZZ9 VALUE ZEROS.
	        PROCEDURE DIVISION.
	   
           ACCEPT WRK-NUM1 FROM CONSOLE.
           ACCEPT WRK-NUM2 FROM CONSOLE.
		   
           DISPLAY '========================='
           DISPLAY 'NÚMERO 1= ' WRK-NUM1.
           DISPLAY 'NÚMERO 2= ' WRK-NUM2.
        
           SUBTRACT WRK-NUM2 FROM WRK-NUM1 GIVING WRK-RESULT.
           MOVE WRK-RESULT TO WRK-RESULT-ED.
           DISPLAY 'RESULTADO SUBTRAÇÃO =' WRK-RESULT-ED
		   
           
           STOP RUN.	
		   
		   
		   