IDENTIFICATION DIVISION.
  PROGRAM-ID. AULA01COBOL02.
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
   SELECT CLIENTES ASSIGN TO 'CAMINHO DO PC, MAS NO BANCO NÃO SE USA ISSO POIS MEXE COM AS INFORMAÇOES DOS CLIENTES (LAYOUT) .'.
   ORGANIZATION IS SEQUENTIAL
   ACESS MODE IS SEQUENTIAL
   FILE STATUS IS CLIENTES-STATUS ' É NESSA PARTE QUE EU RECEBO A TRATATIVA DO AQUIVO, APARECE SE O ARQUIVO FOI ENCONTRADO OU NÃO, SE DEU CERTO OU NÃO.
   

DATA DIVISION.
FILE SECTION.
FD CLIENTES.
10 CLIENTES-REG.
   05 CLIENTES-FONE  PIC 9(99).
   05 CLIENTES-NOME  PIC X(30).
   05 CLIENTES-EMAIL PIC X(40). *O NOSSO LAYOUT É DE 79 POSIÇÕES, POIS 9+30+40=79.

WORKING-STORAGE SECTION.
77 WRK-OPCAO       PIC X(01).
77 WRK-TECLA       PIC X(20).
77 WRK-MODULO      PIC X(25).
77 CLIENTES-STATUS PIC 9(02).
77 WRK-MSGERRO     PIC X(30).


SCREEN SECTION.
01 TELA.
     05 LIMPA-TELA.
        10 BLANCK-SCREEN.
        10 LINE 01 COLUMN 01 PIC X(20) ERASE EOL
          BACKGROUND-COLOR 4. 
        10 LINE 01 COLUMN 15 PIC X(25) 
          BACKGROUND-COLOR 4 FOREGROUND-COLOR 7 FROM ' SISTEMA DE CLIENTES '.
        10 LINE 02 COLUMN 01 PIC X(25) ERASE EOL
          BACKGROUND-COLOR 2 FROM WRK-MODULO.
01 MENU.
     05 LINE 07 COLUMN 15 VALUE ' 1 - INSERIR'.
     05 LINE 08 COLUMN 15 VALUE ' 2 - CONSULTAR'.
     05 LINE 09 COLUMN 15 VALUE ' 3 - ALTERAR'.
     05 LINE 10 COLUMN 15 VALUE ' 4 - EXCLUIR'.
     05 LINE 11 COLUMN 15 VALUE ' 5 - GERAR RELATORIO'.
     05 LINE 12 COLUMN 15 VALUE ' X - SAIR'.
     05 LINE 13 COLUMN 15 VALUE 'OPCAO ....: '.
     05 LINE 13 COLUMN 28 USING WRK-OPCAO. 
     
01 TELA-REGISTRO
    05 CHAVE FOREGROUND-COLOR 2. ' ISSO É PARA SE A SUA BUSCA POR ARQUIVO FOR POR CHAVE .'.
       10 LINE 10 COLUMN 10 VALUE 'TELEFONE '.
       10 COLUMN PLUS 2 PIC 9(99) USING CLIENTES-FONE. 
          BLANCK WHEN ZEROS.
    05 DADOS
       10 LINE 11 COLUMN 10 VALUE 'NOME......'.
       10 COLUMN PLUS 2 PIC X(30) USING CLIENTES-NOME.
       10 LINE 17 COLUMN 10 VALUE 'EMAIL......'.
       10 COLUMN PLUS 2 PIC X(40) USING CLIENTES-EMAIL.
       
01 TELA-ERRO
   02 MSG-ERRO.
      10 LINE 16 COLUMN ERASE EOL BACKGROUND-COLOR 4. 
      10 LINE 16 COLUMN PIC X(30) FROM WRK-MSGERRO BACKGROUND-COLOR 3. ** FOI FEITA UMA CORREÇÃO, NO LUGAR DO USING COLOCAMOS O FROM, SE NÃO O CURSOS IA FICAR PISCANDO.***
      10 COLUMN PLUS 2  PIC X(01) BACKGROUND-COLOR 4 USING WRK-TECLA.
         
     
PROCEDURE DIVISION.
0001-PRINCIPAL SECTION.
   PERFORM 0100-INICIAR THRU 1000-MONTATELA
   PERFORM 0200-PROCESSAR UNTIL WRK-OPCAO = 'X'.
   PERFORM 0300-FINALIZAR.
   STOP RUN.
   
0100-INICIAR.
   OPEN I-O CLIENTES
      IF CLIENTES-STATUS = 35 THEN
         OPEN OUTPUT CLIENTES
         CLOSE CLIENTES
         OPEN I-O
      END-IF.
      
      DISPLAY TELA.
      ACCEPT MENU.
      
1000-MONTATELA
      DISPLAY TELA.
      ACCEPT MENU.

   
0200-PROCESSAR.
   EVALUATE WRK-OPCAO
      WHEN 1
      PERFORM 0400-INCLUIR
         WHEN 2
            PERFORM 0500-CONSULTAR
         WHEN 3
            CONTINUE
         WHEN 4
            CONTINUE
         WHEN 5
            CONTINUE
         WHEN OTHER
           IF WRK-OPCAO NOT EQUAL 'X' 
              DISPLAY ' ESCOLHA INCORRETA. FAVOR INSERIR OPCAO CORRETA. '
           END-IF.     
      
   END-EVALUATE.   
   
       PERFORM 1000-MONTATELA  
   
  
0300-FINALIZAR.
   CLOSE CLIENTES.
   
0400-INCLUIR.
   MOVE 'MODULO - INCLUSAO ' TO WRK-MODULO.
   DISPLAY TELA.
   ACCEPT TELA-REGISTRO.
      WRITE CLIENTES-REG.
      INVALID KEY
      MOVE 'JA EXISTE ' TO WRK-MSGERROERRO.
      ACCEPT TELA-ERRO.
      ACCEPT TECLA
      END-WRITE.
      
0500-CONSULTAR.
   MOVE ' MODULO - CONSULTAR '        TO WRK-MODULO.
   DISPLAY TELA.
      DISPLAY TELA-REGISTRO.
      ACCEPT CHAVE.
         READ CLIENTES.
            INVALID KEY
            MOVE ' NAO ENCONTRADO '   TO WRK-MSGERRO.
            NOT INVALID KEY
            MOVE ' -- ENCONTRADO -- ' TO WRK-MSGERRO
            DISPLAY DADOS
         END-READ.
         ACCEPT MSG-ERRO.
  
  

   
   

