IDENTIFICATION DIVISION.
  PROGRAM-ID. AULA01COBOL02.
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
   SELECT CLIENTES ASSIGN TO 'CAMINHO DO PC, MAS NO BANCO NÃO SE USA ISSO POIS MEXE COM AS INFORMAÇOES DOS CLIENTES (LAYOUT) .'.
   ORGANIZATION IS SEQUENTIAL
   ACESS MODE IS SEQUENTIAL
   FILE STATUS IS CLIENTES-STATUS ' É NESSA PARTE QUE EU RECEBO A TRATATIVA DO AQUIVO, APARECE SE O ARQUIVO FOI ENCONTRADO OU NÃO, SE DEU CERTO OU NÃO.
   RECORD KEY IS CLIENTES-CHAVE.
   
   SELECT RELATO ASSIGN TO 'CAMINHO DO PC, MAS NO BANCO NÃO SE USA ISSO POIS MEXE COM AS INFORMAÇOES DOS CLIENTES (LAYOUT).TXT .'.
   ORGANIZATION IS SEQUENTIAL
   

DATA DIVISION.
FILE SECTION.
FD CLIENTES.
10 CLIENTES-REG.
   05 CLIENTES-FONE  PIC 9(99).
   05 CLIENTES-NOME  PIC X(30).
   05 CLIENTES-EMAIL PIC X(40). *O NOSSO LAYOUT É DE 79 POSIÇÕES, POIS 9+30+40=79.
   
FD RELATO.
10 RELATO-REG.   
   05 RELATO-DADOS   PIC X(79).

WORKING-STORAGE SECTION.
77 WRK-OPCAO       PIC X(01).
77 WRK-TECLA       PIC X(20).
77 WRK-MODULO      PIC X(25).
77 CLIENTES-STATUS PIC 9(02).
77 WRK-MSGERRO     PIC X(30).
77 WRK-CONTALINHA  PIC 9(03) VALUE 0.
77 WRK-QTREGISTROS PIC 9(05) VALUE 0.


SCREEN SECTION.
01 TELA.
     05 LIMPA-TELA.
        10 BLANCK-SCREEN.
        10 LINE 01 COLUMN 01 PIC X(20) ERASE EOL
          BACKGROUND-COLOR 4. 
        10 LINE 01 COLUMN 15 PIC X(25) 
          BACKGROUND-COLOR 4 FOREGROUND-COLOR 7 FROM ' SISTEMA DE CLIENTES '.
        10 LINE 02 COLUMN 01 PIC X(25) ERASE EOL
          BACKGROUND-COLOR 2 FROM WRK-MODULO.
01 MENU.
     05 LINE 07 COLUMN 15 VALUE ' 1 - INSERIR'.
     05 LINE 08 COLUMN 15 VALUE ' 2 - CONSULTAR'.
     05 LINE 09 COLUMN 15 VALUE ' 3 - ALTERAR'.
     05 LINE 10 COLUMN 15 VALUE ' 4 - EXCLUIR'.
     05 LINE 11 COLUMN 15 VALUE ' 5 - GERAR RELATORIO EM TELA '.
     05 LINE 12 COLUMN 15 VALUE ' 6 - GERAR RELATORIO EM DISCO '.
     05 LINE 13 COLUMN 15 VALUE ' X - SAIR'.
     05 LINE 14 COLUMN 15 VALUE 'OPCAO ....: '.
     05 LINE 14 COLUMN 28 USING WRK-OPCAO. 
     
01 TELA-REGISTRO
    05 CHAVE FOREGROUND-COLOR 2. ' ISSO É PARA SE A SUA BUSCA POR ARQUIVO FOR POR CHAVE .'.
       10 LINE 10 COLUMN 10 VALUE 'TELEFONE '.
       10 COLUMN PLUS 2 PIC 9(99) USING CLIENTES-FONE. 
          BLANCK WHEN ZEROS.
    05 DADOS
       10 LINE 11 COLUMN 10 VALUE 'NOME......'.
       10 COLUMN PLUS 2 PIC X(30) USING CLIENTES-NOME.
       10 LINE 17 COLUMN 10 VALUE 'EMAIL......'.
       10 COLUMN PLUS 2 PIC X(40) USING CLIENTES-EMAIL.
       
01 TELA-ERRO
   02 MSG-ERRO.
      10 LINE 16 COLUMN ERASE EOL BACKGROUND-COLOR 4. 
      10 LINE 16 COLUMN PIC X(30) FROM WRK-MSGERRO BACKGROUND-COLOR 3. ** FOI FEITA UMA CORREÇÃO, NO LUGAR DO USING COLOCAMOS O FROM, SE NÃO O CURSOS IA FICAR PISCANDO.***
      10 COLUMN PLUS 2  PIC X(01) BACKGROUND-COLOR 4 USING WRK-TECLA.
         
     
PROCEDURE DIVISION.
0001-PRINCIPAL SECTION.
   PERFORM 0100-INICIAR THRU 1000-MONTATELA
   PERFORM 0200-PROCESSAR UNTIL WRK-OPCAO = 'X'.
   PERFORM 0300-FINALIZAR.
   STOP RUN.
   
0100-INICIAR.
   OPEN I-O CLIENTES
      IF CLIENTES-STATUS = 35 THEN
         OPEN OUTPUT CLIENTES
         CLOSE CLIENTES
         OPEN I-O
      END-IF.
      
      DISPLAY TELA.
      ACCEPT MENU.
      
1000-MONTATELA.
      MOVE 0 TO WRK-QTREGISTROS.
      DISPLAY TELA.
      ACCEPT MENU.

   
0200-PROCESSAR.
   MOVE SPACES TO CLIENTES-NOME CLIENTES-EMAIL 
   EVALUATE WRK-OPCAO
      WHEN 1
      PERFORM 0400-INCLUIR
         WHEN 2
            PERFORM 0500-CONSULTAR
         WHEN 3
            PERFORM 0600-ALTERAR
         WHEN 4
            PERFORM 0700-EXCLUIR
         WHEN 5
            PERFORM 0800-RELATORIOTELA
            WHEN 6
            PERFORM 0900-RELATORIODISCO
         WHEN OTHER
           IF WRK-OPCAO NOT EQUAL 'X' 
              DISPLAY ' ESCOLHA INCORRETA. FAVOR INSERIR OPCAO CORRETA. '
           END-IF.     
      
   END-EVALUATE.   
   
       PERFORM 1000-MONTATELA  
   
  
0300-FINALIZAR.
   CLOSE CLIENTES.
   
0400-INCLUIR.
   MOVE 'MODULO - INCLUSAO ' TO WRK-MODULO.
   DISPLAY TELA.
   ACCEPT TELA-REGISTRO.
      WRITE CLIENTES-REG.
      INVALID KEY
      MOVE 'JA EXISTE ' TO WRK-MSGERRO.
      ACCEPT TELA-ERRO.
      ACCEPT TECLA
      END-WRITE.
      
0500-CONSULTAR.
   MOVE ' MODULO - CONSULTAR '        TO WRK-MODULO.
   DISPLAY TELA.
      DISPLAY TELA-REGISTRO.
      ACCEPT CHAVE.
         READ CLIENTES.
            INVALID KEY
            MOVE ' NAO ENCONTRADO '   TO WRK-MSGERRO.
            NOT INVALID KEY
            MOVE ' -- ENCONTRADO -- ' TO WRK-MSGERRO
            DISPLAY DADOS
         END-READ.
         ACCEPT MSG-ERRO.
 
0600-ALTERAR.
   MOVE ' MODULO - ALTERAR ' TO WRK-MODULO.
   DISPLAY TELA.
   DISPLAY TELA-REGISTRO.
   ACCEPT CHAVE.
      READ CLIENTES
       IF CLIENTES-STATUS = 0 
       ACCEPT DADOS
       REWRITE CLIENTES-REG
         IF CLIENTES-STATUS = 0 
          MOVE ' REGISTRO ALTERADO ' TO WRK-MSGERRO
          ACCEPT MSG-ERRO
          ELSE
          MOVE ' REGISTRO NAO ALTERADO ' TO WRK-MSGERRO 
          ACCEPT MSG-ERRO
          END-IF
       ELSE 
          MOVE ' REGISTRO NAO ENCONTRADO ' TO WRK-MSGERRO
          ACCEPT MSG-ERRO
       END-IF. 
         
0700-EXCLUIR.
   MOVE ' MODULO - EXCLUIR '           TO WRK-MODULO.
   DISPLAY TELA.
       DISPLAY TELA-REGISTRO.
      ACCEPT CHAVE.
         READ CLIENTES.
            INVALID KEY
            MOVE ' NAO ENCONTRADO '   TO WRK-MSGERRO.
            NOT INVALID KEY
            MOVE ' ENCONTRADO (S/N)? ' TO WRK-MSGERRO
            DISPLAY DADOS
         END-READ.
         ACCEPT MSG-ERRO.
            IF WRK-TECLA = 'S' AND CLIENTES-STATUS = 0 
            DELETE CLIENTES
            INVALID KEY 
            MOVE 'NAO EXCLUIDO ' TO WRK-MSGERRO
            ACCEPT MSG-ERRO
            END-DELETE
            END-IF.
            
0800-RELATORIOTELA.
   MOVE ' MODULO - GERAR RELATORIO ' TO WRK-MODULO.
   DISPLAY TELA.
   MOVE 12345 TO CLIENTES-FONE *NÃO SE PODE MOVER PARA A CHAVE, POIS A CHAVE É UM COMPOSTO DE TELAS.*
   START CLIENTES KEY EQUAL CLIENTES-FONE. *A PROPOSTA DE RELATORIO DE TELA DO EXERCICIO É LER A PARTIR DE UM PONTO.**
   READ CLIENTES.
     INVALID KEY
     MOVE 'NENHUM REGISTRO ENCONTRADO ' TO WRK-MSGERRO
     NOT INVALID KEY
     DISPLAY ' RELATORIO DO CLIENTE '
     DISPLAY ' -------------------- '
     PERFORM UNTIL CLIENTES-STATUS = 10
     ADD 1 TO WRK-QTREGISTROS
     
     DISPLAY CLIENTES-FONE '   '
             CLIENTES-NOME '   '
             CLIENTES-EMAIL
    END-PERFORM
   READ CLIENTES NEXT 
     ADD 1 TO WRK-CONTALINHA ** TODA FEZ QUE FOR MUDAR PARA A PROXIMA LEITURA DE RELATORIO IRÁ ADICIONAR MAIS UMA LINHA A VAVIAVEL WRK-CONTALINHA.**
    IF WRK-CONTALINHA > 5  ** CADA LEITURA SERA UMA LINHA**
    MOVE ' PRESSIONE ALGUMA TECLA ' TO WRK-MSGERRO ** COM ESSE MOVE E O ACCEPT ABAIXO CONSEGUIMOS SEGURAR A TELA E FAZER COM QUE TODAS AS INFO APARECAM.
    ACCEPT MSG-ERRO
       MOVE ' MODULO - GERAR RELATORIO ' TO WRK-MODULO. ** SE A LINHA FOR > 5 A TELA SERA LIMPA E O CABEÇALHO REFEITO E A VARIAVEL ZERADA, CONFORME AS INSTRUCOES ABAIXO.**
       DISPLAY TELA.
       DISPLAY ' RELATORIO DO CLIENTE '
       DISPLAY ' -------------------- '
    
    MOVE 0 TO WRK-CONTALINHA
             
   END-IF          
             
             
   END-READ.
      MOVE 'REGISTROS LIDOS ' TO MSG-ERRO. **CONTAR A QUANTIDADE DA STRING  PARA PODER COLOCAR AS PRIMEIRAS POSIÇÕES NA CASA CERTA NA MOVE ABAIXO.**
      MOVE WRK-QTREGISTROS    TO WRK-MSGERRO(17:05). ** O 17 É A QUANTIDADE DA STRING E O 05 É O NUMERO DE POSIÇÕES QUE A OUTRA VARIAVEL TEM.* ISSO SERVE PARA CONCATENAR OS VALORES NAS MESMAS VARIAVEIS.**
   ACCEPT MSG-ERRO.
       
0900-RELATORIODISCO.
   MOVE ' MODULO - GERAR RELATORIO ' TO WRK-MODULO.
   DISPLAY TELA.
   MOVE 12345 TO CLIENTES-FONE 
   START CLIENTES KEY EQUAL CLIENTES-FONE. 
   READ CLIENTES.
     INVALID KEY
     MOVE 'NENHUM REGISTRO ENCONTRADO ' TO WRK-MSGERRO
     NOT INVALID KEY
     OPEN OUTPUT RELATO
  
    
     PERFORM UNTIL CLIENTES-STATUS = 10
     ADD 1 TO WRK-QTREGISTROS
     MOVE CLIENTES-REG TO RELATO-REG
     WRITE RELATO-REG
     CLOSE RELATO

   READ CLIENTES NEXT 
       END-PERFORM
       MOVE ' REGISTROS LIDOS ' TO RELATO-REG
       MOVE WRK-QTREGISTROS     TO RELATO-REG(18:05) 
       WRITE RELATO-REG
       END-READ.
      MOVE 'REGISTROS LIDOS '   TO MSG-ERRO. 
      MOVE WRK-QTREGISTROS      TO WRK-MSGERRO(17:05). 
   ACCEPT MSG-ERRO.      
      
      
      
      
      
      
       
       
     **NESSE EXERCICIO VEMOS A IMPLANTAÇÃO DA VARIAVEL CONTADOR, PARA PODERMOS CONTAR AS LINHAS..**
 
  
  

   
   

