IDENTIFICATION DIVISION.
  PROGRAM-ID. AULA01COBOL02.
ENVIRONMENT DIVISION.

DATA DIVISION.

WORKING-STORAGE SECTION.
77 WRK-OPCAO  PIC X(01).
77 WRK-TECLA PIC X(20).
77 WRK-MODULO PIC X(25).


SCREEN SECTION.
01 TELA.
     05 LIMPA-TELA.
        10 BLANCK-SCREEN.
        10 LINE 01 COLUMN 01 PIC X(20) ERASE EOL
          BACKGROUND-COLOR 4. 
        10 LINE 01 COLUMN 15 PIC X(25) 
          BACKGROUND-COLOR 4 FOREGROUND-COLOR 7 FROM ' SISTEMA DE CLIENTES '.
        10 LINE 02 COLUMN 01 PIC X(25) ERASE EOL
          BACKGROUND-COLOR 2 FROM WRK-MODULO.
01 MENU.
     05 LINE 07 COLUMN 15 VALUE ' 1 - INSERIR'.
     05 LINE 08 COLUMN 15 VALUE ' 2 - CONSULTAR'.
     05 LINE 09 COLUMN 15 VALUE ' 3 - ALTERAR'.
     05 LINE 10 COLUMN 15 VALUE ' 4 - EXCLUIR'.
     05 LINE 11 COLUMN 15 VALUE ' 5 - GERAR RELATORIO'.
     05 LINE 12 COLUMN 15 VALUE ' X - SAIR'.
     05 LINE 13 COLUMN 15 VALUE 'OPCAO ....: '.
     05 LINE 13 COLUMN 28 USING WRK-OPCAO. 
         
     
PROCEDURE DIVISION.
0001-PRINCIPAL SECTION.
   PERFORM 0100-INICIAR.
   PERFORM 0200-PROCESSAR.
   PERFORM 0300-FINALIZAR.
   STOP RUN.
   
0100-INICIAR.
   DISPLAY TELA.
   ACCEPT MENU.
   
0200-PROCESSAR.
   EVALUATE WRK-OPCAO
      WHEN 1
      PERFORM 0400-INCLUIR
         WHEN 2
            CONTINUE
         WHEN 3
            CONTINUE
         WHEN 4
            CONTINUE
         WHEN 5
            CONTINUE
         WHEN OTHER
           IF WRK-OPCAO NOT EQUAL 'X' 
              DISPLAY ' ESCOLHA INCORRETA. FAVOR INSERIR OPCAO CORRETA. '
           END-IF.     
      
   END-EVALUATE.      
   
  
   
   
0400-INCLUIR.
   MOVE 'MODULO - INCLUSAO ' TO WRK-MODULO.
   DISPLAY TELA.
   ACCEPT WRK-TECLA TO 1620.
   
   

