IDENTIFICATION DIVISION.
  PROGRAM-ID. AULA01COBOL02.
ENVIRONMENT DIVISION.

DATA DIVISION.

WORKING-STORAGE SECTION.
77 WRK-OPCAO PIC X(1).

SCREEN SECTION.
01 TELA.
     05 LIMPA-TELA.
        10 BLANCK-SCREEN.
        10 LINE 01 COLUMN 01 ERASE EOL
          BACKGROUND-COLOR 4.
         
     
PROCEDURE DIVISION.
DISPLAY TELA.
   ACCEPT WRK-OPCAO.
   STOP RUN.

